{
    "navigation": {
        "open": "Menü öffnen",
        "close": "Menü schließen",
        "home": "Homepage",
        "contact": "Kontakte",
        "settings": "Einstellungen"
    },
    "skill": {
        "novice": "Anfänger",
        "developing": "Entwickelnd",
        "proficient": "Erfahren",
        "skilled": "Geschickt",
        "advanced": "Fortgeschritten"
    },
    "react": {
        "1": "Als erfahrener Webentwickler beherrsche ich die Verwendung der JavaScript-Bibliothek React.js zum Erstellen dynamischer und interaktiver Benutzeroberflächen für Webanwendungen. Mit meinen mittleren bis fortgeschrittenen React-Kenntnissen bin ich in der Lage, Webseiten mithilfe dieses leistungsstarken und beliebten Front-End-Frameworks effektiv zu programmieren.",
        "2": "React.js ist eine deklarative, komponentenbasierte Bibliothek, die ein effizientes Rendern von UI-Elementen und eine einfache Verwaltung von Status und Requisiten ermöglicht. Ich verfüge über umfassende Erfahrung beim Erstellen von Single-Page-Anwendungen (SPAs) mit React und nutze dessen Kernkonzepte wie virtuelles DOM, JSX-Syntax und React-Hooks.",
        "3": "Neben der Erstellung von SPAs beherrsche ich auch die Integration von React.js in größere Webprojekte, indem ich Tools wie React Router für clientseitiges Routing verwende. Ich nutze regelmäßig Bibliotheken wie React-icons, um Icons zu meinen Anwendungen hinzuzufügen.",
        "4": "Ich kann mit React in Verbindung mit anderen Frontend-Technologien wie CSS und LESS arbeiten. Ich bin auch mit der Verwendung beliebter UI-Bibliotheken wie Bootstrap und Tailwind vertraut, die ich nutzen kann, um benutzerdefinierte UI-Komponenten zu erstellen, die intuitiv, reaktionsschnell und optisch ansprechend sind. Der auf dieser Seite verwendete Container ist beispielsweise vom Bootstrap-Container inspiriert.",
        "5": "Einer der aufregendsten Aspekte der Arbeit mit React.js ist die Möglichkeit, wiederverwendbare und skalierbare Komponenten zu erstellen. Ich habe ein ausgeprägtes Gespür für Design und bin in der Lage, benutzerdefinierte UI-Komponenten zu erstellen, die sich nahtlos in jede Webanwendung einfügen.",
        "6": "Auch das Konzept des Themings in React kenne ich und habe es in Projekten umgesetzt. Diese Seite ist beispielsweise vom Design von Windows 11 inspiriert und kann einfach mit verschiedenen Themen angepasst werden, die in den Einstellungen festgelegt werden können.",
        "7": "Insgesamt sind meine React.js-Fähigkeiten eine wertvolle Bereicherung für jedes Webentwicklungsteam und ich bin zuversichtlich, dass ich mit diesem leistungsstarken Front-End-Framework hochwertige und effiziente Webanwendungen erstellen kann."
    },
    "react_native": {
        "1": "Als erfahrener Entwickler mobiler Apps beherrsche ich die Verwendung von React Native zum Erstellen dynamischer und interaktiver Benutzeroberflächen für iOS- und Android-Anwendungen. Mit meinen mittleren bis fortgeschrittenen Kenntnissen in React Native bin ich in der Lage, mobile Apps mit diesem leistungsstarken und beliebten Front-End-Framework effektiv zu programmieren.",
        "2": "React Native ist eine deklarative, komponentenbasierte Bibliothek, die eine effiziente Darstellung von UI-Elementen und eine einfache Verwaltung von Status und Requisiten ermöglicht. Ich verfüge über umfangreiche Erfahrung beim Erstellen komplexer mobiler Anwendungen mit React Native und nutze dessen Kernkonzepte wie virtuelles DOM, JSX-Syntax und React-Hooks.",
        "3": "Neben der Erstellung mobiler Apps beherrsche ich auch die Integration von React Native in größere Projekte, indem ich Tools wie NativeBase für UI-Design und Komponenten verwende. NativeBase ist eine zugängliche, dienstprogrammorientierte Komponentenbibliothek, die eine einfache Implementierung von Themen und benutzerdefinierten Stilen ermöglicht.",
        "4": "Ich kann mit React Native in Verbindung mit anderen Frontend-Technologien wie JavaScript und StyleSheets arbeiten. Ich habe ein ausgeprägtes Gespür für Design und bin in der Lage, benutzerdefinierte UI-Komponenten zu erstellen, die sich nahtlos in jede mobile Anwendung einfügen.",
        "5": "Einer der aufregendsten Aspekte der Arbeit mit React Native ist die Möglichkeit, wiederverwendbare und skalierbare Komponenten zu erstellen. Mit NativeBase kann ich die vorgefertigten UI-Komponenten nutzen, um intuitive, reaktionsschnelle und optisch ansprechende mobile Anwendungen zu erstellen.",
        "6": "Insgesamt sind meine React Native-Kenntnisse und meine Erfahrung mit NativeBase eine wertvolle Bereicherung für jedes mobile Entwicklungsteam, und ich bin zuversichtlich, dass ich mit diesem leistungsstarken Front-End-Framework qualitativ hochwertige und effiziente mobile Anwendungen erstellen kann."
    },
    "blender": {
        "1": "Als erfahrener 3D-Modellierer beherrsche ich die Verwendung von Blender zur Erstellung dynamischer und hochwertiger 3D-Modelle für verschiedene Zwecke. Mit meinen mittleren Blender-Kenntnissen bin ich in der Lage, effektiv 3D-Modelle für Animationen, 3D-Druck und andere grundlegende Anwendungen zu erstellen.",
        "2": "Eine der Hauptstärken von Blender ist seine Fähigkeit, realistische Materialien für 3D-Modelle zu erstellen. Obwohl ich die Möglichkeit habe, grundlegende Materialien selbst zu erstellen, nutze ich oft BlenderKit, eine leistungsstarke Online-Datenbank mit hochwertigen Materialien, die sich leicht in meine Projekte integrieren lässt.",
        "3": "Neben der Modellierung kann ich mit Blender auch Animationen erstellen, die Modelle zum Leben erwecken. Ich bin mit Stoffsimulationen, Haken und anderen Animationstools vertraut, die es mir ermöglichen, realistische Bewegungen und Interaktionen innerhalb der 3D-Umgebung zu erstellen.",
        "4": "Blender bietet außerdem leistungsstarke Simulationsfunktionen wie Stoffsimulation und Partikeleffekte. Ich habe Erfahrung darin, diese Funktionen zu nutzen, um in meinen Projekten atemberaubende visuelle Effekte zu erzielen.",
        "5": "Zusätzlich zu meinen technischen Fähigkeiten habe ich ein ausgeprägtes Gespür für Design und bin in der Lage, optisch ansprechende und ästhetisch ansprechende 3D-Modelle zu erstellen. Ich arbeite auch gerne mit Kunden zusammen, um ihre spezifischen Bedürfnisse zu verstehen und diese in meine Designs zu integrieren.",
        "6": "Insgesamt sind meine Fähigkeiten in Blender eine wertvolle Bereicherung für jedes 3D-Modellierungsteam und ich bin zuversichtlich, dass ich mit dieser leistungsstarken Software qualitativ hochwertige, visuell beeindruckende 3D-Modelle erstellen kann."
    },
    "404": {
        "error": "404-Fehler",
        "text": "Seite nicht gefunden"
    },
    "niccalc": {
        "heading": "Der Rechner zum Mischen von E-Liquids",
        "base": {
            "text": "E-Liquid-Basis",
            "amount": "Gewünschte E-Liquid-Menge",
            "ratio": "Gewünschtes VG/PG-Verhältnis"
        },
        "aroma": {
            "text": "Aroma",
            "strength": "Gewünschte Aromastärke"
        },
        "ice": {
            "text": "Eis",
            "strength": "Gewünschte Eisstärke"
        },
        "nicotine": {
            "text": "Nikotin",
            "desired": "Gewünschte Nikotinstärke",
            "base": "Stärke der Nikotinbasis",
            "ratio": "Nikotinbasis-VG/PG-Verhältnis"
        },
        "pricing": "Legen Sie die Preise pro ml fest",
        "add_costs": "Zusätzliche Kosten",
        "margin": "Gewinnspanne",
        "results": {
            "text": "Endgültige Ergebnisse",
            "price": "Preis",
            "profit": "Gewinn",
            "total": "Gesamt"
        }
    }
}